# Import pandas and CSV file & Display Data Frame

In [2]:
# Importing Data
import pandas as pd
import os

student_data = os.path.join('.', 'Resources', 'new_student_data.csv')
student_df = pd.read_csv(student_data)

# Display Data Frame
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

In [3]:
# Display one Data Frame (Aka. Column)
student_df["student_name"]

0            Sarah Douglas
1        Francisco Osborne
2                Ryan Haas
3             Kathryn Mack
4          Harold Reynolds
               ...
13935          Kelly Myers
13936       Kimberly Burke
13937      Crystal Merritt
13938        Misty Wiggins
13939        Michele Jones
Name: student_name, Length: 13940, dtype: object

# Identifying Missing Data

In [3]:
# Missing data shown as NaN

import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df

     AAPL
0   72.27
1     NaN
2   74.39
3     NaN
4   75.94
5   76.93
6     NaN
7   78.74
8     NaN
9   79.81
10    NaN
11  79.53
12    NaN
13  79.56
14  79.49

In [10]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

# This commmand allows us to count the number of NaNs are present in our file.
apple_df.isnull().sum()

# By identifying the missing data and determining how much data is missing, we took an important first step in the data preparation process. Now, we need to decide how to handle the missing data.

AAPL    6
dtype: int64

# Handeling missing data

In [11]:
# We can handle missing data values in one of two ways: by removing, or dropping, them or by replacing, or filling, them.

# If we have a large dataset with just a few missing values, we might want to drop the rows that contain the missing values. Dropping a small number of rows from a large dataset shouldnâ€™t change the overall structure of the data. In this case, the results of the analysis should remain the same.

# But if we have a smaller dataset or many NaN values, we donâ€™t want to drop the rows. Doing so might drastically change the datasetâ€”and thus the resulting analysis. Instead, we want to fill as many of the NaN values as possible with a logical alternative value.

# Drop the Missing Data

In [13]:
# To drop the rows of data that have missing values, we use the dropna function. Letâ€™s try this on an example dataset.

In [14]:
apple_df.dropna()

     AAPL
0   72.27
2   74.39
4   75.94
5   76.93
7   78.74
9   79.81
11  79.53
13  79.56
14  79.49

# Fill the Missing Data

In [16]:
# Replace the NaNs with "Unknown"
## CODE: daily_returns = daily_returns.fillna("Unknown")

# Replace the NaNs with 0
## CODE: daily_returns = daily_returns.fillna(0)

# Replace the NaNs with the mean of the column
## CODE: daily_returns = daily_returns.fillna(daily_returns.mean())

In [17]:
apple_df

     AAPL
0   72.27
1     NaN
2   74.39
3     NaN
4   75.94
5   76.93
6     NaN
7   78.74
8     NaN
9   79.81
10    NaN
11  79.53
12    NaN
13  79.56
14  79.49

In [22]:
# Filled data w/ averages
apple_df = apple_df.fillna(apple_df.mean())
apple_df

         AAPL
0   72.270000
1   77.406667
2   74.390000
3   77.406667
4   75.940000
5   76.930000
6   77.406667
7   78.740000
8   77.406667
9   79.810000
10  77.406667
11  79.530000
12  77.406667
13  79.560000
14  79.490000

# Identify Any Duplicates

In [23]:
#Pandas offers the duplicated function for identifying duplicated rows in a DataFrame.

#Let's try it on a DataFrame thatâ€™s named best_actors_df and that has duplicated rows, as the following code shows:

In [30]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford", "Will Smith", "Brad Pitt"]
})
best_actors_df

     Best Actors
0       Nic Cage
1       Nic Cage
2  Harrison Ford
3     Will Smith
4      Brad Pitt

In [43]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford", "Will Smith", "Brad Pitt"]
})
best_actors_df

best_actors_df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [45]:
best_actors_df.duplicated().sum()

1

# Drop the Duplicates

In [46]:
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford
3     Will Smith
4      Brad Pitt

# Identifying Messy Text Data

In [47]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd": ["$0.53", "$0.22", "0.34"]
})

prices

  price_usd
0     $0.53
1     $0.22
2      0.34

In [48]:
prices.dtypes

price_usd    object
dtype: object

# Remove Symbols from Text Data

In [55]:
prices.loc[:, 'price_usd'] = prices.loc[:,"price_usd"].str.replace("$", "")
prices

C:\Users\checo\AppData\Local\Temp/ipykernel_8736/2782423921.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  prices.loc[:, 'price_usd'] = prices.loc[:,"price_usd"].str.replace("$", "")

  price_usd
0      0.53
1      0.22
2      0.34

In [56]:
prices.dtypes

price_usd    object
dtype: object

# Convert a Text Data Type to a Numerical Data Type

In [58]:
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].astype("float")

prices

   price_usd
0       0.53
1       0.22
2       0.34

In [59]:
prices.dtypes

price_usd    float64
dtype: object

In [87]:
# To see more examples and excercises see Student_Data_Starte_Code in Module Excercises folder

# Generate a Bunch of Summary Statistics

In [4]:
sales_df = pd.DataFrame({"item": ["tomatos", "onions", "potatos", "tomatoes", "mushrooms"], 
                        "quantity": [15, 26, 10, 12, 2],
                         "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})

sales_df

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
2    potatos        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [89]:
sales_df.describe()

        quantity  total_price
count   5.000000     5.000000
mean   13.000000    37.688000
std     8.717798    17.128761
min     2.000000     8.460000
25%    10.000000    39.520000
50%    12.000000    40.200000
75%    15.000000    50.010000
max    26.000000    50.250000

In [90]:
sales_df.describe(include='all')

           item   quantity  total_price
count         5   5.000000     5.000000
unique        5        NaN          NaN
top     tomatos        NaN          NaN
freq          1        NaN          NaN
mean        NaN  13.000000    37.688000
std         NaN   8.717798    17.128761
min         NaN   2.000000     8.460000
25%         NaN  10.000000    39.520000
50%         NaN  12.000000    40.200000
75%         NaN  15.000000    50.010000
max         NaN  26.000000    50.250000

In [91]:
# PopQuiz Question in Module
import pandas as pd 
goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15, 1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df

       AAPL
0   1045.85
1   1070.08
2   1140.99
3   1113.65
4   1193.32
5   1231.54
6   1215.00
7   1207.15
8   1248.84
9   1166.27
10  1138.85
11  1003.63
12  1080.91

In [93]:
# This PopQuiz relies on the following data:
goog_df.describe()

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

# Generate a Specific Summary Statistic

In [94]:
sales_df.mean()

C:\Users\checo\AppData\Local\Temp/ipykernel_8736/2906524947.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sales_df.mean()

quantity       13.000
total_price    37.688
dtype: float64

In [95]:
sales_df.max()

item           tomatos
quantity            26
total_price      50.25
dtype: object

In [96]:
sales_df.std()

C:\Users\checo\AppData\Local\Temp/ipykernel_8736/2723106739.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sales_df.std()

quantity        8.717798
total_price    17.128761
dtype: float64

In [97]:
min_price = sales_df["total_price"].min()
min_price

8.46

# Selecting and Sorting

In [116]:
import pandas as pd
import numpy as py

# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})

# Select the first row using iloc
aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [117]:
aapl_returns = [0.5, 0.56, 0.59, 0.52, 0.1]
first_item = aapl_returns[0]
first_item

0.5

In [118]:
aapl_returns[0:3]

[0.5, 0.56, 0.59]

In [119]:
aapl_returns.iloc[0:3]

AttributeError: 'list' object has no attribute 'iloc'

# Select Rows by Index

In [120]:
import numpy as py
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000), 
    index=pd.date_range('1/1/2017', periods=1000), 
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      801
2019-09-24      378
2019-09-25      109
2019-09-26      145
2019-09-27      646

In [121]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31']

            revenue
2018-10-01      671
2018-10-02      603
2018-10-03      246
2018-10-04      395
2018-10-05      380
...             ...
2019-03-27      757
2019-03-28      248
2019-03-29      787
2019-03-30      997
2019-03-31      656

[182 rows x 1 columns]

In [122]:
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   495.302198
std    273.769314
min      2.000000
25%    248.250000
50%    489.500000
75%    721.250000
max    997.000000

# Selecting Rows by Filtering

In [124]:
sales_df.head()

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
2    potatos        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [125]:
sales_df["quantity"] > 10

0     True
1     True
2    False
3     True
4    False
Name: quantity, dtype: bool

In [128]:
filter = sales_df["quantity"] > 10
sales_df.loc[filter]

       item  quantity  total_price
0   tomatos        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [129]:
sales_df.loc[sales_df["quantity"] > 10]

       item  quantity  total_price
0   tomatos        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

# Select Rows by Combining Filters

In [130]:
sales_df

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
2    potatos        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [131]:
sales_df.loc[(sales_df["quantity"] > 10) &
            (sales_df["total_price"] < 45)]

       item  quantity  total_price
1    onions        26        39.52
3  tomatoes        12        40.20

In [ ]:
# If we change the ampersand (&) to a pipe (|), the code will select all the rows where either the quantity is greater than ten, the price is less than 45, or both statements are true. Hereâ€™s the code:

In [132]:
sales_df.loc[(sales_df["quantity"] > 10) |
            (sales_df["total_price"] < 45)]

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
3   tomatoes        12        40.20
4  mushrooms         2         8.46

# Select Rows with mean, min, or max

In [135]:
sales_df

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
2    potatos        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [137]:
min_price = sales_df["total_price"].min()
min_price_row = sales_df.loc[sales_df["total_price"] == min_price]
min_price_row

        item  quantity  total_price
4  mushrooms         2         8.46

In [138]:
max_price = sales_df["total_price"].max()
max_price_row = sales_df.loc[sales_df["total_price"] == max_price]
max_price_row

      item  quantity  total_price
0  tomatos        15        50.25

In [141]:
sales_df.loc[sales_df["item"] == "tomatoes", ["total_price"]].mean()

total_price    40.2
dtype: float64

# Selecting Columns

In [142]:
sales_df

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
2    potatos        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [143]:
sales_df.iloc[0:3, [0, 2]]

      item  total_price
0  tomatos        50.25
1   onions        39.52
2  potatos        50.01

In [144]:
sales_df.loc[sales_df["item"] == "tomatoes", ["quantity", "total_price"]]

   quantity  total_price
3        12         40.2

In [145]:
sales_df.loc[:, ["item", "total_price"]]

        item  total_price
0    tomatos        50.25
1     onions        39.52
2    potatos        50.01
3   tomatoes        40.20
4  mushrooms         8.46

# Sorting Values by Columns

In [146]:
sales_df

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
2    potatos        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [147]:
sales_df.sort_values("total_price")

        item  quantity  total_price
4  mushrooms         2         8.46
1     onions        26        39.52
3   tomatoes        12        40.20
2    potatos        10        50.01
0    tomatos        15        50.25

In [148]:
sales_df.sort_values("total_price", ascending=False)

        item  quantity  total_price
0    tomatos        15        50.25
2    potatos        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [152]:
sales_df.sort_values(['total_price', 'item'], ascending=False)

        item  quantity  total_price
0    tomatos        15        50.25
2    potatos        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

# Aggregating the Data

In [5]:
sales_df

        item  quantity  total_price
0    tomatos        15        50.25
1     onions        26        39.52
2    potatos        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [10]:
Sales_df = pd.DataFrame({
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms","potatoes","onions", "tomatoes", "onions", "tomatoes" ], 
    "store": ["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown","Downtown", "Midtown", "Midtown", "Midtown"], 
    "quantity": [15,26,10,12,2,3,17,16,20,9],
    "total_price": [50.25,39.52,50.10,40.20,8.46,15.03,25.84,53.60,30.40,30.15]})
Sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

In [11]:
item_group_df = Sales_df.groupby("item")
item_group_df

# Compare the Data Aggregations

In [12]:
item_group_df = Sales_df.groupby("item")
item_group_df.mean()

           quantity  total_price
item
mushrooms       2.0        8.460
onions         21.0       31.920
potatoes        6.5       32.565
tomatoes       13.0       43.550

In [17]:
store_item_group_df = Sales_df.groupby(["store", "item"])
store_item_group_df.max()

                    quantity  total_price
store    item
Downtown mushrooms         2         8.46
         onions           26        39.52
         tomatoes         15        50.25
Midtown  onions           20        30.40
         potatoes         10        50.10
         tomatoes         16        53.60